{"body":"Steal from Devil May Cry 5 and have the player character pose on the main menu screen.\r\n\r\nI want to let people have an avatar, so centring that immediately seems smart. Let players customise the pose, and the background location (including the location of the latest save for immediate continue? In that case, an algorithm for cinematic camera placement would be neat, but posing may need to include special cases for flying through the air etc.)\r\n\r\nPlayers should feel welcome/home as soon as they open the game.\r\n\r\nThis could also provide a good place to switch between contexts/profiles, such as \"Kyle in JOSP\" or \"my PVP character and clan tag\" or \"my RPG persona\", by flipping through the characters and backgrounds.\r\n\r\nWill require menu extensions as described in #65.","closed":false,"comments":[{"id":"IC_kwDOAIyaz85RaC0a","author":{"login":"mrwonko"},"authorAssociation":"OWNER","body":"I started drawing a mockup of how a character select screen could look:\r\n![main menu character selection](https://user-images.githubusercontent.com/220725/209650432-da74bf5c-c067-4e80-b71d-ca53eedf83e0.jpg)\r\nnone of that is final, I just threw some ideas out there. Some buttons are missing, in particular there need to be separate buttons for creating a new character, and sending a character off on a new adventure (hey, maybe that's a better name for \"context\"). The character/context split might be confusing, and I need to figure out how to handle save games. Tying them to specific characters would be confusing (people won't find their saves), but having the option to filter them that way would probably be good. Maybe just show the associated character on hover/selection in the load screen?\r\n","createdAt":"2022-12-27T10:13:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/mrwonko/TheseusJA/issues/66#issuecomment-1365781786","viewerDidAuthor":true}],"labels":[],"milestone":null,"projectCards":[],"projectItems":[],"state":"OPEN","title":"player model intro screen"}
